package Test;
/*
1. 一个类与它的对象之间是什么关系？
   1.类是对一类事物的描述,是抽象的
   2.对象是一类事物的实例,是具体的
   3.类是对象的模版,对象是类的实体
2. 如何定义一个类，由哪些部分组成，各个部分的作用是什么？
   成员变量作用:
   成员方法作用:
3. 如何创建一个对象，如何使用该对象？
类名  对象名  =  new  类名();
对象名.成员变量;
对象名.成员方法();
4. 局部变量和成员变量的区别？
     1.在类中的位置不同:成员变量在类中,方法外;
                        局部变量在方法中或方法声明上(形式参数).
     2.作用范围不一样:成员变量的作用范围在类中;
                      局部变量的作用范围在方法中;
     3.初始化值不同:成员变量有默认值(null,0,0.0)
                    局部变量没有默认值,需要先定义,在赋值,然后才能使用.
5. 构造方法和成员方法的区别？

*/
public class Demo {
}
